Repository: AriDevari/Naviari_IOS
Catalog: Naviari_IOS/*.lproj/Localizable.strings
Languages: fi, sv

# welcome_message
source: Welcome to use Naviari system. This app is for race managers and boats participating in races. Please start by selecting the race and start.
fi: Tervetuloa käyttämään Naviari-järjestelmää. Tämä sovellus on kilpailun järjestäjille ja kilpailuihin osallistuville veneille. Aloita valitsemalla kilpailu ja lähtö.
sv: Välkommen till Naviari-systemet. Den här appen är för tävlingsledare och båtar som deltar i tävlingar. Börja med att välja tävling och start.

# select_race_button
source: Select a race
fi: Valitse kilpailu
sv: Välj en tävling

# open_races_button
source: Open races
fi: Avaa kilpailut
sv: Öppna tävlingar

# races_title
source: Races
fi: Kilpailut
sv: Tävlingar

# races_loading
source: Loading races…
fi: Ladataan kilpailuja…
sv: Hämtar tävlingar…

# races_error
source: Couldn't load races.
fi: Kilpailujen lataus epäonnistui.
sv: Det gick inte att hämta tävlingar.

# races_retry_button
source: Try again
fi: Yritä uudelleen
sv: Försök igen

# races_empty
source: No races available.
fi: Ei kilpailuja saatavilla.
sv: Inga tävlingar tillgängliga.

# race_selection_placeholder
source: Select a race to see its starts.
fi: Valitse kilpailu nähdäksesi sen lähdöt.
sv: Välj en tävling för att se dess starter.

# race_date_label
source: Date
fi: Päivä
sv: Datum

# race_status_label
source: Status
fi: Tila

# race_description_label
source: Description
fi: Kuvaus
sv: Beskrivning

# race_starts_title
source: Starts
fi: Lähdöt
sv: Starter

# starts_empty
source: No starts published yet.
fi: Lähtöjä ei ole vielä julkaistu.
sv: Inga starter publicerade ännu.

# close_button
source: Close
fi: Sulje
sv: Stäng

# back_button
source: Back
fi: Takaisin
sv: Tillbaka

# participate_button
source: Start GPS Broadcast
fi: Aloita GPS-lähetys
sv: Starta GPS-sändning

# participate_title
source: GPS Broadcast
fi: GPS-lähetys
sv: GPS-sändning

# participate_name_label
source: Name
fi: Nimi
sv: Namn

# participate_name_placeholder
source: Boat or skipper name
fi: Veneen tai kipparin nimi
sv: Båtens eller skepparens namn

# participate_name_help
source: Boat name or in windsurfing the surfer name
fi: Veneen nimi tai purjelautailussa surffaajan nimi
sv: Båtens namn eller surfarens namn i vindsurfing

# participate_sail_label
source: Sail Number
fi: Purjenumero
sv: Segelnummer

# participate_sail_placeholder
source: e.g. FIN-123
fi: esim. FIN-123
sv: t.ex. FIN-123

# participate_rating_placeholder
source: e.g. 1.123
fi: esim. 1,123
sv: t.ex. 1,123

# participate_description_label
source: Description
fi: Kuvaus
sv: Beskrivning

# participate_description_placeholder
source: Notes for organizers
fi: Lisätietoja järjestäjille
sv: Info till arrangörerna

# participate_club_label
source: Club
fi: Seura
sv: Klubb

# participate_club_placeholder
source: Home club
fi: Kotiseura
sv: Hemmaklubb

# participate_color_label
source: Color
fi: Väri
sv: Färg

# participate_code_label
source: Participation Code
fi: Osallistumiskoodi
sv: Deltagarkod

# participate_code_prefix
source: Code
fi: Koodi
sv: Kod

# participate_code_suffix
source: Suffix
fi: Loppuosa

# participate_cta_hint
source: Share your live GPS with the race team.
fi: Jaa GPS-sijaintisi kilpailujohdolle.
sv: Dela din GPS-position med tävlingsledningen.

# participate_info_title
source: GPS Broadcast Help
fi: GPS-lähetyksen ohje
sv: GPS-sändning – hjälp

# participate_info_body
source: Provide boat and contact details plus the code from the race office, then start the GPS broadcast so spectators and race management can see your live position.
fi: Anna veneen tiedot sekä kilpailutoimistolta saatu koodi ja käynnistä GPS-lähetys, jotta yleisö ja kilpailunjohto näkevät sijaintisi reaaliajassa.
sv: Fyll i båtuppgifterna och koden från tävlingskontoret och starta sedan GPS-sändningen så att publik och arrangör kan följa din position i realtid.

# participate_code_required
source: Enter the full participation code.
fi: Anna koko osallistumiskoodi.
sv: Ange hela deltagarkoden.

# participate_start_missing
source: Missing start identifier.
fi: Lähtöä ei löytynyt.
sv: Starten hittades inte.

# participate_code_reuse_notice
source: Code already on file from this race – you can start broadcasting immediately.
fi: Koodi on jo tallessa tältä sarjalta – voit aloittaa lähetyksen heti.
sv: Koden finns redan sparad för den här serien – du kan starta sändningen direkt.

# broadcast_status_active
source: Broadcasting…
fi: Lähetys käynnissä…
sv: Sändning pågår…

# broadcast_status_active_subtitle
source: Your phone keeps sending GPS data even when locked.
fi: Puhelin lähettää GPS-tietoa myös lukittuna.
sv: Telefonen skickar GPS-data även när den är låst.

# broadcast_status_inactive
source: Preparing broadcast
fi: Valmistellaan lähetystä
sv: Förbereder sändning

# broadcast_status_placeholder
source: Broadcast isn’t running yet. Start it again if needed.
fi: Lähetys ei ole käynnissä. Käynnistä se uudelleen tarvittaessa.
sv: Sändningen är inte aktiv. Starta den igen vid behov.

# broadcast_status_last_sample
source: Latest GPS sample
fi: Uusin GPS-näyte
sv: Senaste GPS-mätning

# broadcast_status_last_upload
source: Last upload
fi: Viimeisin lähetys
sv: Senaste uppladdning

# broadcast_status_waiting_sample
source: Waiting for GPS sample
fi: Odotetaan GPS-näytettä
sv: Väntar på GPS-mätning

# broadcast_status_waiting_upload
source: Waiting for first upload
fi: Odotetaan ensimmäistä lähetystä
sv: Väntar på första uppladdningen

# broadcast_status_error_prefix
source: Upload error
fi: Virhe lähetyksessä
sv: Uppladdningsfel

# broadcast_status_backlog_label
source: Backlog
fi: Jonossa
sv: Kö

# broadcast_status_backlog_clear
source: All caught up
fi: Kaikki lähetetty
sv: Allt är skickat

# broadcast_status_backlog_value
source: %@ pending
fi: %@ jonossa
sv: %@ kvar att skicka

# broadcast_status_retry_label
source: Retries
fi: Uudelleenyritykset
sv: Nya försök

# broadcast_status_retry_count_value
source: %d attempts
fi: %d yritystä
sv: %d försök

# error_invalid_url
source: Invalid server URL.
fi: Virheellinen palvelimen osoite.
sv: Ogiltig serveradress.

# error_invalid_response
source: Server responded with an error.
fi: Palvelin vastasi virheellä.
sv: Servern svarade med ett fel.

# error_decoding_failed
source: App could not read the response.
fi: Vastausta ei voitu lukea.
sv: Appen kunde inte läsa svaret.

# error_missing_race_id
source: Race identifier missing.
fi: Kilpailun tunnistetta ei löytynyt.
sv: Tävlingens ID saknas.

# error_server_with_message
source: Server error (%d): %@
fi: Palvelinvirhe (%d): %@
sv: Serverfel (%d): %@

# error_server_without_message
source: Server error (%d)
fi: Palvelinvirhe (%d)
sv: Serverfel (%d)

# race_unnamed_placeholder
source: Unnamed race
fi: Nimetön kilpailu
sv: Namnlös tävling

# start_status_unknown
source: Unknown
fi: Tuntematon
sv: Okänd

# done_button
source: Done
fi: Valmis
sv: Klar

# gps_status_title
source: GPS Status
fi: GPS-tila

# gps_status_latitude
source: Latitude
fi: Leveysaste
sv: Latitud

# gps_status_longitude
source: Longitude
fi: Pituusaste
sv: Longitud

# gps_status_speed
source: Speed
fi: Nopeus
sv: Fart

# gps_status_course
source: Course
fi: Suunta
sv: Kurs

# gps_status_unavailable
source: Unavailable
fi: Ei saatavilla
sv: Inte tillgänglig

# gps_status_waiting
source: Waiting for GPS lock
fi: Odotetaan GPS-signaalia
sv: Väntar på GPS-lås

# gps_status_accessibility
source: GPS accuracy %.1f meters
fi: GPS-tarkkuus %.1f metriä
sv: GPS-noggrannhet %.1f meter

# gps_status_accuracy
source: Accuracy
fi: Tarkkuus
sv: Noggrannhet
